simaja_ci4/app/Models/AbsensiModel.php

    public function cekSudahAbsen($userId, $jadwalId)
    {
        return $this->where(['user_id' => $userId, 'jadwal_id' => $jadwalId])->first();
---
SELECT *
FROM `absensi`
WHERE `user_id` = '14'
AND `jadwal_id` = '1'
 LIMIT 1