simaja_ci4/app/Models/PendaftaranModel.php

    public function cekTerdaftar($userId, $jadwalId)
    {
        return $this->where(['user_id' => $userId, 'jadwal_id' => $jadwalId])->first();
---
SELECT *
FROM `pendaftaran`
WHERE `user_id` = '14'
AND `jadwal_id` = '1'
 LIMIT 1