simaja_ci4/app/Models/ProfileModel.php

SELECT *
FROM `profiles`
WHERE `user_id` = '13'
 LIMIT 1
---
    public function getProfile($userId)
    {
        return $this->where('user_id', $userId)->first();