simaja_ci4/app/Controllers/HomeController.php

SELECT *
FROM `home_content`
WHERE `home_content`.`id` = 1
SELECT *
FROM `jadwal`
ORDER BY `tanggal` ASC
 LIMIT 6
SELECT *
FROM `pendaftaran`
WHERE `user_id` = '13'
---
    public function index()
    {
        $jadwalModel = new JadwalModel();
        $pendaftaranModel = new PendaftaranModel();
        $homeModel = new HomeContentModel();

        $homeContent = $homeModel->find(1);
        if (!$homeContent) {
            $homeContent = [
                'hero_title'       => 'Hi, Selamat Datang di SIMAJA',
                'hero_subtitle'    => 'Sistem Manajemen Study Jam',
                'hero_description' => 'Temukan pengalaman belajar baru bersama SIMAJA.',
                'hero_image'       => 'studyjam.png'
            ];
        }

        $dataJadwal = $jadwalModel->orderBy('tanggal', 'ASC')->findAll(6);
        $userId = user_id();
        $daftarJadwalSaya = [];

        if ($userId) {
            $dataPendaftaran = $pendaftaranModel->where('user_id', $userId)->findAll();