simaja_ci4/app/Controllers/ProfileController.php

SELECT SUM(`skor`) AS `skor`
FROM `nilai`
WHERE `user_id` = '13'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `user_progress`
WHERE `user_id` = '13'
AND `is_completed` = 1
---
    public function profile()
    {
        if (!logged_in()) return redirect()->to('/login');

        $userId = user_id();
        $profileModel = new ProfileModel();
        $nilaiModel = new NilaiModel();
        $progressModel = new UserProgressModel();

        $userProfile = $profileModel->getProfile($userId);

        $totalPoinArr = $nilaiModel->where('user_id', $userId)->selectSum('skor')->first();
        $totalPoin = $totalPoinArr['skor'] ?? 0;

        $materiSelesai = $progressModel->where(['user_id' => $userId, 'is_completed' => 1])->countAllResults();