simaja_ci4/app/Controllers/Api/Auth.php

    public function login()
    {
        $data = $this->request->getJSON();
        $login = $data->login ?? null; // Bisa username atau email
        $password = $data->password ?? null;

        if (!$login || !$password) {
            return $this->fail('Username/Email dan password wajib diisi', 400);
        }

        $userModel = new UserModel();
        // Cari user berdasarkan username ATAU email
        $user = $userModel->where('username', $login)
                          ->orWhere('email', $login)
                          ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'mahasiswa'
OR `email` = 'mahasiswa'
 LIMIT 1

    public function register()
    {
        $data = $this->request->getJSON();

        $username = $data->username ?? null;
        $email = $data->email ?? null;
        $password = $data->password ?? null;

        if (!$username || !$email || !$password) {
            return $this->fail('Semua kolom wajib diisi', 400);
        }

        $userModel = new UserModel();

        // Cek duplikasi email atau username
        if ($userModel->where('email', $email)->first()) {
            return $this->fail('Email sudah terdaftar', 409);
        }
        if ($userModel->where('username', $username)->first()) {
            return $this->fail('Username sudah dipakai', 409);
        }

        // Simpan user baru
        $userModel->save([
            'username' => $username,
            'email' => $email,
            'password_hash' => password_hash($password, PASSWORD_DEFAULT),
            'role' => 'user',
            'active' => 1,
            'created_at' => Time::now()
        ]);
---
SELECT *
FROM `users`
WHERE `email` = 'giska@gmail.com'
 LIMIT 1
SELECT *
FROM `users`
WHERE `username` = 'mahasiswa'
 LIMIT 1
INSERT INTO `users` (`username`, `email`, `password_hash`, `role`, `active`, `created_at`, `updated_at`) VALUES ('mahasiswa', 'giska@gmail.com', '$2y$12$X8I2E4xYtXeARWuI3jGjo.d2FVvPH9aemTzn6U2xFZJkIzHi5syPm', 'user', 1, '2026-06-09 07:56:04', '2026-06-09 07:56:04')