simaja_ci4/app/Controllers/Api/Jadwal.php

    public function index()
    {
        $jadwalModel = new JadwalModel();
        $pendaftaranModel = new PendaftaranModel();

        $userId = $this->request->getVar('user_id');

        $dataJadwal = $jadwalModel->orderBy('tanggal', 'ASC')->findAll();
        $daftarJadwalSaya = [];

        if ($userId) {
            $dataPendaftaran = $pendaftaranModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `jadwal`
ORDER BY `tanggal` ASC
SELECT *
FROM `pendaftaran`
WHERE `user_id` = '14'

    public function daftar()
    {
        $data = $this->request->getJSON();
        $userId = $data->user_id ?? null;
        $jadwalId = $data->jadwal_id ?? null;

        if (!$userId || !$jadwalId) return $this->fail('Data tidak lengkap', 400);

        $jadwalModel = new JadwalModel();
        $pendaftaranModel = new PendaftaranModel();

        $jadwal = $jadwalModel->find($jadwalId);
        if (!$jadwal) return $this->failNotFound('Jadwal tidak ditemukan.');

        if ($pendaftaranModel->cekTerdaftar($userId, $jadwalId)) {
            return $this->fail('Anda sudah terdaftar.', 409);
        }

        if ($jadwal['terisi'] >= $jadwal['kuota']) {
            return $this->fail('Kuota penuh.', 400);
        }

        $db = \Config\Database::connect();
        $db->transStart();
            $pendaftaranModel->save(['user_id' => $userId, 'jadwal_id' => $jadwalId]);
            $jadwalModel->update($jadwalId, ['terisi' => $jadwal['terisi'] + 1]);
---
SELECT *
FROM `jadwal`
WHERE `jadwal`.`id` = '1'
INSERT INTO `pendaftaran` (`user_id`, `jadwal_id`, `created_at`, `updated_at`) VALUES ('14', '1', '2026-06-11 03:42:36', '2026-06-11 03:42:36')
UPDATE `jadwal` SET `terisi` = 37, `updated_at` = '2026-06-11 03:42:36'
WHERE `jadwal`.`id` IN ('1')

    public function absensi()
    {
        $data = $this->request->getJSON();
        $userId = $data->user_id ?? null;
        $jadwalId = $data->jadwal_id ?? null;
        $status = $data->status ?? 'Hadir';

        if (!$userId || !$jadwalId) return $this->fail('Data tidak lengkap', 400);

        $absensiModel = new AbsensiModel();

        if ($absensiModel->cekSudahAbsen($userId, $jadwalId)) {
            return $this->fail('Anda sudah mengisi absensi.', 409);
        }

        $absensiModel->save([
            'user_id'    => $userId,
            'jadwal_id'  => $jadwalId,
            'status'     => $status,
            'created_at' => Time::now()
        ]);
---
INSERT INTO `absensi` (`user_id`, `jadwal_id`, `status`, `created_at`, `updated_at`) VALUES ('14', '1', 'Hadir', '2026-06-11 03:42:41', '2026-06-11 03:42:41')