simaja_ci4/app/Controllers/Api/Materi.php

SELECT *
FROM `materi`
SELECT `materi_id`, COUNT(id) as completed
FROM `user_progress`
WHERE `user_id` = '14'
AND `is_completed` = 1
GROUP BY `materi_id`
---
    public function index()
    {
        $materiModel = new MateriModel();
        $progressModel = new UserProgressModel();

        $userId = $this->request->getVar('user_id');
        $dataMateri = $materiModel->findAll();
        $progressData = [];

        if ($userId) {
            $userProgress = $progressModel->select('materi_id, COUNT(id) as completed')
                                          ->where('user_id', $userId)
                                          ->where('is_completed', 1)
                                          ->groupBy('materi_id')
                                          ->findAll();

SELECT *
FROM `pertemuan`
WHERE `pertemuan`.`id` = '1'
SELECT *
FROM `user_progress`
WHERE `user_id` = '14'
AND `pertemuan_id` = '1'
 LIMIT 1
INSERT INTO `user_progress` (`user_id`, `materi_id`, `pertemuan_id`, `is_completed`, `completed_at`) VALUES ('14', '1', '1', 1, '2026-06-11 03:47:22')
---
    public function complete()
    {
        $data = $this->request->getJSON();
        $userId = $data->user_id ?? null;
        $pertemuanId = $data->pertemuan_id ?? null;

        if (!$userId || !$pertemuanId) return $this->fail('Data tidak lengkap', 400);

        $progressModel = new UserProgressModel();
        $pertemuanModel = new PertemuanModel();

        $pertemuan = $pertemuanModel->find($pertemuanId);
        if (!$pertemuan) return $this->failNotFound('Data pertemuan tidak valid.');

        $materiId = $pertemuan['materi_id'];
        $exists = $progressModel->where(['user_id' => $userId, 'pertemuan_id' => $pertemuanId])->first();

        if (!$exists) {
            $progressModel->save([
                'user_id' => $userId,
                'materi_id' => $materiId,
                'pertemuan_id' => $pertemuanId,
                'is_completed' => 1,
                'completed_at' => Time::now()
            ]);