simaja_ci4/app/Controllers/Api/Profile.php

SELECT *
FROM `profiles`
WHERE `user_id` = '14'
 LIMIT 1
SELECT SUM(`skor`) AS `skor`
FROM `nilai`
WHERE `user_id` = '14'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `user_progress`
WHERE `user_id` = '14'
AND `is_completed` = 1
---
    public function index()
    {
        $userId = $this->request->getVar('user_id');
        if (!$userId) return $this->fail('User ID wajib dikirim', 400);

        $profileModel = new ProfileModel();
        $nilaiModel = new NilaiModel();
        $progressModel = new UserProgressModel();

        // 1. Ambil Biodata
        $userProfile = $profileModel->where('user_id', $userId)->first();

        // 2. Hitung Total Poin
        $totalPoinArr = $nilaiModel->where('user_id', $userId)->selectSum('skor')->first();
        $totalPoin = $totalPoinArr['skor'] ?? 0;

        // 3. Hitung Jam Belajar (1 materi selesai = 2 jam)
        $materiSelesai = $progressModel->where(['user_id' => $userId, 'is_completed' => 1])->countAllResults();