simaja_ci4/app/Controllers/Api/Progres.php

SELECT COUNT(*) AS `numrows`
FROM `user_progress`
WHERE `user_id` = '14'
AND `is_completed` = 1
SELECT DATE(completed_at) as tanggal
FROM `user_progress`
WHERE `user_id` = '14'
GROUP BY DATE(completed_at)
ORDER BY `tanggal` DESC
---
    public function index()
    {
        $userId = $this->request->getVar('user_id');
        if (!$userId) return $this->fail('User ID wajib dikirim', 400);

        $progressModel = new UserProgressModel();
        $materiModel = new MateriModel();

        // 1. Total Jam
        $totalSelesai = $progressModel->where(['user_id' => $userId, 'is_completed' => 1])->countAllResults();
        $totalJam = $totalSelesai * 2;

        // 2. Hitung Streak (Aktivitas beruntun)
        $aktivitas = $progressModel->select('DATE(completed_at) as tanggal')
                                   ->where('user_id', $userId)
                                   ->groupBy('DATE(completed_at)')
                                   ->orderBy('tanggal', 'DESC')
                                   ->findAll();

SELECT *
FROM `materi`
SELECT COUNT(*) AS `numrows`
FROM `user_progress`
WHERE `user_id` = '14'
AND `materi_id` = '1'
AND `is_completed` = 1
---
        }

        // 3. Target Bulanan
        $semuaMateri = $materiModel->findAll();
        $targetBulanan = [];
        foreach ($semuaMateri as $m) {
            $completedCount = $progressModel->where([
                'user_id' => $userId,
                'materi_id' => $m['id'],
                'is_completed' => 1
            ])->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `user_progress`
WHERE `user_id` = '14'
AND `completed_at` >= '2026-06-01 00:00:00'
AND `completed_at` <= '2026-06-07 23:59:59'
---
            $startDate = date('Y-m-') . sprintf("%02d", $startDay);
            $endDate = date('Y-m-') . sprintf("%02d", $endDay);

            $count = $progressModel->where('user_id', $userId)
                                   ->where('completed_at >=', $startDate . ' 00:00:00')
                                   ->where('completed_at <=', $endDate . ' 23:59:59')
                                   ->countAllResults();

SELECT `nilai`.`user_id`, SUM(nilai.skor) as total_skor, `profiles`.`nama_lengkap`, `profiles`.`jurusan`, `profiles`.`prodi`
FROM `nilai`
LEFT JOIN `profiles` ON `profiles`.`user_id` = `nilai`.`user_id`
GROUP BY `nilai`.`user_id`, `profiles`.`nama_lengkap`, `profiles`.`jurusan`, `profiles`.`prodi`
ORDER BY `total_skor` DESC
---
    public function peringkat()
    {
        $db = \Config\Database::connect();

        $builder = $db->table('nilai');
        $builder->select('nilai.user_id, SUM(nilai.skor) as total_skor, profiles.nama_lengkap, profiles.jurusan, profiles.prodi');
        $builder->join('profiles', 'profiles.user_id = nilai.user_id', 'left');
        $builder->groupBy('nilai.user_id, profiles.nama_lengkap, profiles.jurusan, profiles.prodi');
        $builder->orderBy('total_skor', 'DESC');

        $allRankings = $builder->get()->getResultArray();