simaja_ci4/app/Controllers/Api/Quiz.php

    public function listPertemuan()
    {
        $materiId = $this->request->getVar('materi_id');
        $userId = $this->request->getVar('user_id');

        if (!$materiId || !$userId) return $this->fail('Materi ID dan User ID wajib dikirim', 400);

        $pertemuanModel = new PertemuanModel();
        $nilaiModel = new NilaiModel();

        $listPertemuan = $pertemuanModel->where('materi_id', $materiId)->findAll();

        $nilaiUser = [];
        $dataNilai = $nilaiModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `pertemuan`
WHERE `materi_id` = '1'
SELECT *
FROM `nilai`
WHERE `user_id` = '14'